solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_mipi_dsi.c
    if (config->autoInsertEoTp)
    {
        base->CFG_AUTOINSERT_EOTP = 0x01U;
    }
    else
    {
        base->CFG_AUTOINSERT_EOTP = 0x00U;
    }

    base->CFG_EXTRA_CMDS_AFTER_EOTP = config->numExtraEoTp;
    base->CFG_HTX_TO_COUNT          = config->htxTo_ByteClk;
    base->CFG_LRX_H_TO_COUNT        = config->lrxHostTo_ByteClk;
    base->CFG_BTA_H_TO_COUNT        = config->btaTo_ByteClk;

    DSI_ApbClearRxFifo(base);

    /* Disable all interrupts by default, user could enable
     * the desired interrupts later.
     */
    base->IRQ_MASK  = 0xFFFFFFFFU;
    base->IRQ_MASK2 = 0xFFFFFFFFU;
}

/*!
 * brief Deinitializes an MIPI DSI host.
 *
 * This function should be called after all bother MIPI DSI driver functions.
 *
 * param base MIPI DSI host peripheral base address.
 */
void DSI_Deinit(MIPI_DSI_HOST_Type *base)
{
#if defined(DSI_RESETS_ARRAY)
    RESET_PeripheralReset(s_dsiResets[DSI_GetInstance(base)]);
#endif

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    (void)CLOCK_DisableClock(s_dsiClocks[DSI_GetInstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/*!
 * brief Get the default configuration to initialize the MIPI DSI host.
 *
 * The default value is:
 * code
    config->numLanes = 4;
    config->enableNonContinuousHsClk = false;
    config->enableTxUlps = false;
    config->autoInsertEoTp = true;
    config->numExtraEoTp = 0;
    config->htxTo_ByteClk = 0;
    config->lrxHostTo_ByteClk = 0;
    config->btaTo_ByteClk = 0;
   endcode
 *
 * param config Pointer to a user-defined configuration structure.
 */
void DSI_GetDefaultConfig(dsi_config_t *config)
{
    assert(NULL != config);

    /* Initializes the configure structure to zero. */
    (void)memset(config, 0, sizeof(*config));

    config->numLanes                 = 4;
    config->enableNonContinuousHsClk = false;
#if (defined(FSL_FEATURE_MIPI_DSI_HOST_HAS_ULPS_CTRL) && FSL_FEATURE_MIPI_DSI_HOST_HAS_ULPS_CTRL)
    config->enableTxUlps = false;
#endif /* FSL_FEATURE_MIPI_DSI_HOST_HAS_ULPS_CTRL */
    config->autoInsertEoTp    = true;
    config->numExtraEoTp      = 0;
    config->htxTo_ByteClk     = 0;
    config->lrxHostTo_ByteClk = 0;
    config->btaTo_ByteClk     = 0;
}

/*!
 * brief Configure the DPI interface core.
 *
 * This function sets the DPI interface configuration, it should be used in
 * video mode.
 *
 * param base MIPI DSI host peripheral base address.
 * param config Pointer to the DPI interface configuration.
 * param numLanes Lane number, should be same with the setting in ref dsi_dpi_config_t.
 * param dpiPixelClkFreq_Hz The DPI pixel clock frequency in Hz.
 * param dsiHsBitClkFreq_Hz The DSI high speed bit clock frequency in Hz. It is
 * the same with DPHY PLL output.
 */
void DSI_SetDpiConfig(MIPI_DSI_HOST_Type *base,
                      const dsi_dpi_config_t *config,
                      uint8_t numLanes,
                      uint32_t dpiPixelClkFreq_Hz,
                      uint32_t dsiHsBitClkFreq_Hz)
{
    assert(NULL != config);

    /* coefficient DPI event size to number of DSI bytes. */
    float coff = ((float)numLanes * (float)dsiHsBitClkFreq_Hz) / ((float)dpiPixelClkFreq_Hz * 8.0f);

#if (defined(FSL_FEATURE_MIPI_DSI_HOST_HAS_PXL2DPI) && FSL_FEATURE_MIPI_DSI_HOST_HAS_PXL2DPI)
    SOC_MIPI_DSI_SetPixelDpiMap(base, (uint32_t)config->dpiColorCoding);
#endif /* FSL_FEATURE_MIPI_DSI_HOST_HAS_PXL2DPI */

    base->CFG_DPI_PIXEL_PAYLOAD_SIZE     = config->pixelPayloadSize;
    base->CFG_DPI_INTERFACE_COLOR_CODING = (uint32_t)config->dpiColorCoding;
    base->CFG_DPI_PIXEL_FORMAT           = (uint32_t)config->pixelPacket;
    base->CFG_DPI_VIDEO_MODE             = (uint32_t)config->videoMode;

    if (kDSI_DpiBllpLowPower == config->bllpMode)
    {
        base->CFG_DPI_BLLP_MODE         = 0x1U;
        base->CFG_DPI_USE_NULL_PKT_BLLP = 0x0U;
    }
    else if (kDSI_DpiBllpBlanking == config->bllpMode)
    {
        base->CFG_DPI_BLLP_MODE         = 0x0U;
        base->CFG_DPI_USE_NULL_PKT_BLLP = 0x0U;
    }
    else
    {
        base->CFG_DPI_BLLP_MODE         = 0x0U;
        base->CFG_DPI_USE_NULL_PKT_BLLP = 0x1U;
    }

    if (0U != (config->polarityFlags & (uint32_t)kDSI_DpiVsyncActiveHigh))
    {
        base->CFG_DPI_VSYNC_POLARITY = 0x01U;
    }
    else
    {
        base->CFG_DPI_VSYNC_POLARITY = 0x00U;
    }

    if (0U != (config->polarityFlags & (uint32_t)kDSI_DpiHsyncActiveHigh))
    {
        base->CFG_DPI_HSYNC_POLARITY = 0x01U;
    }
    else
    {
        base->CFG_DPI_HSYNC_POLARITY = 0x00U;
    }

    base->CFG_DPI_HFP                   = (uint32_t)((float)config->hfp * coff - (float)DSI_HFP_OVERHEAD_BYTE);
    base->CFG_DPI_HBP                   = (uint32_t)((float)config->hbp * coff - (float)DSI_HBP_OVERHEAD_BYTE);
    base->CFG_DPI_HSA                   = (uint32_t)((float)config->hsw * coff - (float)DSI_HSA_OVERHEAD_BYTE);

    base->CFG_DPI_PIXEL_FIFO_SEND_LEVEL = config->pixelPayloadSize;
    base->CFG_DPI_VBP = config->vbp;
    base->CFG_DPI_VFP = config->vfp;

    base->CFG_DPI_VACTIVE = config->panelHeight;
    base->CFG_DPI_VC      = config->virtualChannel;
}

/*!
 * brief Initializes the D-PHY
 *
 * This function configures the D-PHY timing and setups the D-PHY PLL based on
 * user configuration. The configuration structure could be got by the function
 * ref DSI_GetDphyDefaultConfig.
 *
 * param base MIPI DSI host peripheral base address.
 * param config Pointer to the D-PHY configuration.
 * param refClkFreq_Hz The REFCLK frequency in Hz.
 * return The actual D-PHY PLL output frequency. If could not configure the
 * PLL to the target frequency, the return value is 0.
 */
uint32_t DSI_InitDphy(MIPI_DSI_HOST_Type *base, const dsi_dphy_config_t *config, uint32_t refClkFreq_Hz)
{
    assert(config);

#if !((defined(FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    uint32_t cn = 0x0U;
    uint32_t cm = 0x0U;
    uint32_t co = 0x0U;
    uint32_t outputPllFreq;

    outputPllFreq = DSI_DphyGetPllDivider(&cn, &cm, &co, refClkFreq_Hz, config->txHsBitClk_Hz);

    /* If could not find dividers for the output PLL frequency. */
    if (0U == outputPllFreq)
    {
        return 0U;
    }

