solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/drivers/fsl_mipi_dsi.c
        status = DSI_PrepareApbTransfer(base, &handle->xfer);

        if (kStatus_Success == status)
        {
            DSI_SendApbPacket(base);
            handle->isBusy = true;

            /* Enable the interrupts. */
            if (0U != (handle->xfer.flags & (uint32_t)kDSI_TransferPerformBTA))
            {
                DSI_EnableInterrupts(
                    base,
                    DSI_INT_STATUS_TRIGGER_MASK | (uint32_t)kDSI_InterruptGroup1ApbRxHeaderReceived |
                        (uint32_t)kDSI_InterruptGroup1ApbRxPacketReceived | (uint32_t)kDSI_InterruptGroup1BtaTo |
                        (uint32_t)kDSI_InterruptGroup1LrxTo | (uint32_t)kDSI_InterruptGroup1HtxTo |
                        (uint32_t)kDSI_InterruptGroup1AckTriggerReceived,
                    (uint32_t)kDSI_InterruptGroup2EccMultiBit | (uint32_t)kDSI_InterruptGroup2CrcError);
            }
            else
            {
                DSI_EnableInterrupts(base,
                                     (uint32_t)kDSI_InterruptGroup1ApbTxDone | (uint32_t)kDSI_InterruptGroup1HtxTo, 0U);
            }
        }
    }

    return status;
}

/*!
 * brief Abort current APB data transfer.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
void DSI_TransferAbort(MIPI_DSI_HOST_Type *base, dsi_handle_t *handle)
{
    assert(NULL != handle);

    if (handle->isBusy)
    {
        /* Disable the interrupts. */
        DSI_DisableInterrupts(base,
                              (uint32_t)kDSI_InterruptGroup1ApbTxDone | DSI_INT_STATUS_TRIGGER_MASK |
                                  DSI_INT_STATUS_ERROR_REPORT_MASK | (uint32_t)kDSI_InterruptGroup1ApbRxHeaderReceived |
                                  (uint32_t)kDSI_InterruptGroup1ApbRxPacketReceived |
                                  (uint32_t)kDSI_InterruptGroup1BtaTo | (uint32_t)kDSI_InterruptGroup1LrxTo |
                                  (uint32_t)kDSI_InterruptGroup1HtxTo,
                              (uint32_t)kDSI_InterruptGroup2EccMultiBit | (uint32_t)kDSI_InterruptGroup2CrcError);

        /* Reset transfer info. */
        (void)memset(&handle->xfer, 0, sizeof(handle->xfer));

        /* Reset the state to idle. */
        handle->isBusy = false;
    }
}

/*!
 * brief Interrupt handler for the DSI.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
void DSI_TransferHandleIRQ(MIPI_DSI_HOST_Type *base, dsi_handle_t *handle)
{
    assert(NULL != handle);

    status_t status;
    uint32_t intFlags1;
    uint32_t intFlags2;
    uint32_t timeout;

    /* If no transfer in progress, return directly. */
    if (handle->isBusy)
    {
        /* Make sure the transfer is completed. */
        timeout = FSL_MIPI_DSI_IDLE_TIMEOUT;
        while (0U != (timeout--))
        {
            if (0U == (base->PKT_STATUS & (uint32_t)kDSI_ApbNotIdle))
            {
                break;
            }
        }

        if (0U == timeout)
        {
            DSI_TransferAbort(base, handle);
            status = kStatus_Timeout;
        }
        else
        {
            /* Disable the interrupts. */
            DSI_DisableInterrupts(
                base,
                (uint32_t)kDSI_InterruptGroup1ApbTxDone | DSI_INT_STATUS_TRIGGER_MASK |
                    DSI_INT_STATUS_ERROR_REPORT_MASK | (uint32_t)kDSI_InterruptGroup1ApbRxHeaderReceived |
                    (uint32_t)kDSI_InterruptGroup1ApbRxPacketReceived | (uint32_t)kDSI_InterruptGroup1BtaTo |
                    (uint32_t)kDSI_InterruptGroup1LrxTo | (uint32_t)kDSI_InterruptGroup1HtxTo,
                (uint32_t)kDSI_InterruptGroup2EccMultiBit | (uint32_t)kDSI_InterruptGroup2CrcError);

            DSI_GetAndClearInterruptStatus(base, &intFlags1, &intFlags2);

            status         = DSI_HandleResult(base, intFlags1, intFlags2, &handle->xfer);
            handle->isBusy = false;
        }

        if (NULL != handle->callback)
        {
            handle->callback(base, handle, status, handle->userData);
        }
    }

    return;
}

#if defined(MIPI_DSI_HOST)
void MIPI_DriverIRQHandler(void);
void MIPI_DriverIRQHandler(void)
{
    s_dsiIsr(MIPI_DSI_HOST, s_dsiHandle[0]);
}
#endif

#if defined(DI_MIPI_DSI_LVDS_0__MIPI_DSI_HOST)
void MIPI_DSI0_INT_OUT_DriverIRQHandler(void);
void MIPI_DSI0_INT_OUT_DriverIRQHandler(void)
{
    s_dsiIsr(DI_MIPI_DSI_LVDS_0__MIPI_DSI_HOST, s_dsiHandle[0]);
}
#endif

#if defined(DI_MIPI_DSI_LVDS_1__MIPI_DSI_HOST)
void MIPI_DSI1_INT_OUT_DriverIRQHandler(void);
void MIPI_DSI1_INT_OUT_DriverIRQHandler(void)
{
    s_dsiIsr(DI_MIPI_DSI_LVDS_1__MIPI_DSI_HOST, s_dsiHandle[1]);
}
#endif

#if defined(MIPI_DSI_HOST0)
void MIPI_DSI0_INT_OUT_DriverIRQHandler(void);
void MIPI_DSI0_INT_OUT_DriverIRQHandler(void)
{
    s_dsiIsr(MIPI_DSI_HOST0, s_dsiHandle[0]);
}
#endif

#if defined(MIPI_DSI_HOST1)
void MIPI_DSI1_INT_OUT_DriverIRQHandler(void);
void MIPI_DSI1_INT_OUT_DriverIRQHandler(void)
{
    s_dsiIsr(MIPI_DSI_HOST1, s_dsiHandle[1]);
}
#endif

#if defined(MIPI_DSI)
void DSI_DriverIRQHandler(void);
void DSI_DriverIRQHandler(void)
{
    s_dsiIsr(MIPI_DSI, s_dsiHandle[0]);
}
#endif
